_posts/technology/2023-04-07-cppcoreguidelines-es28.html
---
layout: post
title: CppCoreGuidelines ES.28 使用 lambda 初始化复杂对象，尤其是常变量
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Use lambdas for complex initialization, especially of const variables&rdquo;
</p>

<p>
理由
</p>

<p>
可以很好的把局部初始化封装起来。包括清理初始化过程中用到的临时变量，无需创建非局部，却不会重用的函数。此规则也适用于需要特定初始化工作的常量。
</p>

<p>
坏例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">x</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">should be const, but:</span>
<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">i</span> = 2; i &lt;= N; ++i<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>          <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">this could be some</span>
    x += some_obj.do_something_with<span style="color: #7388d6;">(</span>i<span style="color: #7388d6;">)</span>;  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">arbitrarily long code</span>
<span style="color: #707183;">}</span>                                        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">needed to initialize x</span>
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">from here, x should be const, but we can't say so in code in this style</span>
</pre>
</div>

<p>
好例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">x</span> = <span style="color: #707183;">[</span>&amp;<span style="color: #707183;">]</span> <span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">val</span>;                                <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">assume that widget</span>
                                               <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">has a default</span>
                                               <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">constructor</span>
    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">i</span> = 2; i &lt;= N; ++i<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>            <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">this could be some</span>
        val += some_obj.do_something_with<span style="color: #909183;">(</span>i<span style="color: #909183;">)</span>;  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">arbitrarily long code</span>
    <span style="color: #7388d6;">}</span>                                          <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">needed to initialize x</span>
    <span style="color: #7F0055; font-weight: bold;">return</span> val;
<span style="color: #707183;">}()</span>;
</pre>
</div>

<p>
如果可行的话，尽量将分支条件限定在某一组简单的数据集。（比如可以是一个枚举）。不要把初始化和选择分支语句混合在一起使用。
</p>


<p>
强化
</p>

<p>
比较难，只能是探索式的。检查是否有未初始化变量，其后紧跟一个循环给这个变量赋值。
</p>
